# Intro to pandas

### Install libraries

In [ ]:
# run cell to install pandas if not already installed
!pip install pandas

### Import libraries

In [65]:
# We use 'import pandas as pd' instead of 'import pandas' to
# give Pandas a shorter alias or nickname. This is a common
# convention in Python programming, especially for libraries
# that have long names or are frequently used. By using 'pd'
# as an alias for Pandas, we can save time and typing when we
# need to use Pandas functions or objects in our code. For
# example, instead of typing 'pandas.DataFrame()', we can
# simply type 'pd.DataFrame()'. This makes our code more
# concise and easier to read.

import pandas as pd

### Reading from files

To read data from a file, you can use the `read_csv()` function in Pandas. This function
reads a CSV file and returns a data frame, which is a two-
dimensional table of data.

In [81]:
df = pd.read_csv("data/Adidas US Sales Datasets.csv")

In [82]:
df.head()

,Retailer,Retailer ID,Invoice Date,Region,State,City,Product,Price per Unit,Units Sold,Total Sales,Operating Profit,Operating Margin,Sales Method
0,Foot Locker,1185732,1/1/2020,Northeast,New York,New York,Men's Street Footwear,$50.00,"1,200","$600,000","$300,000",50%,In-store
1,Foot Locker,1185732,1/2/2020,Northeast,New York,New York,Men's Athletic Footwear,$50.00,"1,000","$500,000","$150,000",30%,In-store
2,Foot Locker,1185732,1/3/2020,Northeast,New York,New York,Women's Street Footwear,$40.00,"1,000","$400,000","$140,000",35%,In-store
3,Foot Locker,1185732,1/4/2020,Northeast,New York,New York,Women's Athletic Footwear,$45.00,850,"$382,500","$133,875",35%,In-store
4,Foot Locker,1185732,1/5/2020,Northeast,New York,New York,Men's Apparel,$60.00,900,"$540,000","$162,000",30%,In-store

### Selecting data

To select specific columns or rows from a data frame, you can use indexing and slicing.
For example, to select a specific column, you can use the syntax `df['column_name']`, where df is the name of the dataframe and `'column_name'` is the name of the column.

In [83]:
# selecting a column from the dataframe
df["Product"].head()

0        Men's Street Footwear
1      Men's Athletic Footwear
2      Women's Street Footwear
3    Women's Athletic Footwear
4                Men's Apparel
Name: Product, dtype: object

In [84]:
# selecting columns from the dataframe
# instead of using a string, we use a list of strings
df[["Region", "State", "City"]].head()

      Region     State      City
0  Northeast  New York  New York
1  Northeast  New York  New York
2  Northeast  New York  New York
3  Northeast  New York  New York
4  Northeast  New York  New York

### Data manipulation

It is the process of cleaning, transforming, and reshaping data to prepare it for
analysis. Pandas provides a wide range of functions and
techniques for data manipulation, including:  

- Cleaning data: cleaning data refers to the process of identifying and correcting or removing errors, inconsistencies, and inaccuracies in a data set. This can include handling missing values, correcting data types, removing duplicates, and dealing with outliers. Pandas provides a wide
- Transforming data: Pandas provides functions for applying mathematical operations, string operations, and custom functions to data.

### Data cleaning

In [85]:
# checking if there are missing values in our dataframe
# isull() checks if the dataframe has any null values
# if a cell is null, the isnull() method will retrun 1 otherwise it'll return 0
df.isnull().sum()

Retailer            0
Retailer ID         0
Invoice Date        0
Region              0
State               0
City                0
Product             0
Price per Unit      0
Units Sold          0
Total Sales         0
Operating Profit    0
Operating Margin    0
Sales Method        0
dtype: int64

In [86]:
# from the above, we can see that there are no missing values

In [87]:
# if our dataframe has records with null values we can remove them by using dropna()
df = df.dropna()

In [88]:
# instead of removing the columns columns with null values,
# we can fill the null cells with a certain value. that value
# could be a '0', the mean of the column, or a prediction
# from a trained model

# example of filling empty cells in the units sold column with a 0
df["Units Sold"] = df["Units Sold"].fillna(0)

 Other data cleaning methods are replace() and drop_duplicates()

### Data transformation

- Mathematical operations: You can add a constant value to a column using the syntax `df['column_name'] + constant_value`.
- Applying string operations: You can concatenate two columns using the syntax `df['new_column'] = df['column1'] + df['column2']`.
- Applying custom functions: Pandas provides functions for applying custom functions to data in a data frame using the `apply(custom_function)` method.

In [89]:
# converting 'Units Sold' from str to int by using the apply function
def convert_str_to_int(text):
    text = text.replace(",", "") # replace the comma in the string to avoid getting errors
    converted_text = int(text) # coverting the string to an integer
    return converted_text

df["Units Sold"] = df["Units Sold"].apply(convert_str_to_int)

In [90]:
# adding a constant to all values in a column
# you can do the same for subtraction and other mathematical operations
df["Units Sold"] + 1000

0       2200
1       2000
2       2000
3       1850
4       1900
        ...
9643    1064
9644    1105
9645    1184
9646    1070
9647    1083
Name: Units Sold, Length: 9648, dtype: int64

### Filtering data

To filter data based on specific conditions, you can use
boolean indexing. For example, to select rows where a
certain column has a value greater than a certain threshold,
you can use the syntax `df[df['column_name'] > threshold]`.
This will return a new data frame that contains only the
rows that meet the specified condition.

In [63]:
# selecting records with more than 1000 units sold
df[df["Units Sold"] > 1000].head()

,Retailer,Retailer ID,Invoice Date,Region,State,City,Product,Price per Unit,Units Sold,Total Sales,Operating Profit,Operating Margin,Sales Method
0,Foot Locker,1185732,1/1/2020,Northeast,New York,New York,Men's Street Footwear,$50.00,1200,"$600,000","$300,000",50%,In-store
6,Foot Locker,1185732,1/7/2020,Northeast,New York,New York,Men's Street Footwear,$50.00,1250,"$625,000","$312,500",50%,In-store
12,Foot Locker,1185732,1/25/2020,Northeast,New York,New York,Men's Street Footwear,$50.00,1220,"$610,000","$305,000",50%,Outlet
18,Foot Locker,1185732,1/31/2020,Northeast,New York,New York,Men's Street Footwear,$50.00,1200,"$600,000","$300,000",50%,Outlet
24,Foot Locker,1185732,2/6/2020,Northeast,New York,New York,Men's Street Footwear,$60.00,1220,"$732,000","$366,000",50%,Outlet

### Grouping and aggregations

To perform grouping and aggregation in Pandas, you can use
the `groupby()` function. This function groups the data frame
by one or more columns and returns a `groupby` object, which
can then be used to apply aggregate functions to each group.

In [28]:
# grouped by retailer
grouped_by_retailer = df.groupby("Retailer")

In [43]:
# printing the number of groups or number of different retailers, in our case, we have in the dataframe
print("Number of retailers -", len(grouped_by_retailer))

Number of retailers - 6

In [44]:
print(f"Type of grouped_by_retailer: {type(grouped_by_retailer)}")

Type of grouped_by_retailer: <class 'pandas.core.groupby.generic.DataFrameGroupBy'>

Aggregations in Pandas refer to the process of applying a
function to a group of data in a data frame. This is
typically done using the groupby() function, which groups
the data by one or more columns and returns a groupby
object. Once the data is grouped, you can apply an aggregate
function to each group to calculate a summary statistic,
such as the sum, mean, or count of a particular column. Some
common aggregate functions in Pandas include sum(), mean(),
count(), max(), and min(). Aggregations are a powerful tool
for data analysis and can help you gain insights into your
data by summarizing it in meaningful ways.

NB: Aggregations can be applied to a dataframe without grouping the data

In [47]:
# calculating total units sold per group
for group in grouped_by_retailer:
    group_name, group_data = group
    
    total_sales_per_group = group_data["Units Sold"].sum()
    print(f"Total units sold at {group_name} -", total_sales_per_group)
    
# you can try the other aggregation functions like sum(), mean(), max() and min()

Total units sold at Amazon - 197990
Total units sold at Foot Locker - 604369
Total units sold at Kohl's - 287375
Total units sold at Sports Direct - 557640
Total units sold at Walmart - 206225
Total units sold at West Gear - 625262

### Sorting data

To sort data in Pandas, you can use the `sort_values()`
function. This function sorts the data frame by one or more
columns in ascending or descending order.``` sorted_df = df.sort_values('sales_amount',
ascending=False) ```  This code sorts the data frame by the
'sales_amount' column in descending order and returns a new
data frame called sorted_df. You can also sort by multiple
columns by passing a list of column names to the
sort_values() function.   There are many other options
available in the sort_values() function, including sorting
by a specific data type, handling missing values, and
specifying the sorting algorithm. Sorting is an important
data manipulation task in Pandas and can help you organize
your data for analysis and visualization.

In [50]:
# sort the data by number of units sold
# records with the most units sold will appear at the top
sorted_df = df.sort_values('Units Sold', ascending=False)
sorted_df.head()

,Retailer,Retailer ID,Invoice Date,Region,State,City,Product,Price per Unit,Units Sold,Total Sales,Operating Profit,Operating Margin,Sales Method
36,Foot Locker,1185732,3/10/2020,Northeast,New York,New York,Men's Street Footwear,$60.00,1275,"$765,000","$382,500",50%,Outlet
6,Foot Locker,1185732,1/7/2020,Northeast,New York,New York,Men's Street Footwear,$50.00,1250,"$625,000","$312,500",50%,In-store
30,Foot Locker,1185732,3/4/2020,Northeast,New York,New York,Men's Street Footwear,$60.00,1250,"$750,000","$375,000",50%,Outlet
42,Foot Locker,1185732,3/16/2020,Northeast,New York,New York,Men's Street Footwear,$60.00,1250,"$750,000","$375,000",50%,Outlet
24,Foot Locker,1185732,2/6/2020,Northeast,New York,New York,Men's Street Footwear,$60.00,1220,"$732,000","$366,000",50%,Outlet

In [51]:
# records with the least units sold will appear at the bottom
sorted_df.tail()

,Retailer,Retailer ID,Invoice Date,Region,State,City,Product,Price per Unit,Units Sold,Total Sales,Operating Profit,Operating Margin,Sales Method
4914,Foot Locker,1185732,6/12/2021,Midwest,Nebraska,Omaha,Men's Apparel,$42.00,6,$252,$121,48%,Online
4907,Foot Locker,1185732,6/5/2021,Midwest,Nebraska,Omaha,Women's Athletic Footwear,$33.00,0,$0,$0,55%,Online
4913,Foot Locker,1185732,6/11/2021,Midwest,Nebraska,Omaha,Women's Athletic Footwear,$27.00,0,$0,$0,53%,Online
1019,Foot Locker,1185732,6/5/2021,Midwest,Nebraska,Omaha,Women's Athletic Footwear,$35.00,0,$0,$0,40%,Outlet
1025,Foot Locker,1185732,6/11/2021,Midwest,Nebraska,Omaha,Women's Athletic Footwear,$30.00,0,$0,$0,40%,Outlet